{
  "name": "WooEasyLife",
  "slug": "woo-easy-life",
  "version": "1.2.1",
  "author": "Muhibbullah Ansary",
  "homepage": "https://api.wpsalehub.com/get-metadata",
  "download_url": "https://api.wpsalehub.com/download-plugins",
  "requires": {
    "wordpress": "5.0",
    "php": "7.4",
    "woocommerce": "5.0"
  },
  "license": "GPL-2.0-or-later",
  "sections": {
    "description": "=== Woo Easy Life ===\nContributors: muhibbullah, nasir\nTags: woocommerce, sms, otp validation, fraud prevention, abandoned cart, cache prevention, cors, order cloning, shipping methods\nRequires at least: 5.0\nTested up to: 6.2\nStable tag: 1.2.0\nRequires PHP: 7.4\nLicense: GPLv2 or later\nLicense URI: https://www.gnu.org/licenses/gpl-2.0.html\n\nWoo Easy Life is an all-in-one WooCommerce plugin designed to enhance store management with automation, customer engagement, fraud prevention, order cloning, courier integrations, and real-time data delivery.\n\n== Description ==\n\n**Woo Easy Life** simplifies WooCommerce operations with features such as order cloning, bulk SMS notifications, abandoned cart recovery, fraud prevention, shipping zone management, courier integrations, and advanced cache prevention for real-time data.\n\n### **Key Features**\n\n- **Order Cloning**: Clone existing orders with complete product, shipping, and payment data from both WooCommerce and custom API formats.\n- **Smart Shipping Method Lookup**: Automatically matches shipping methods by name and retrieves complete method details from zones.\n- **Shipping Zone Support**: Properly handles shipping methods configured across multiple zones with instance ID matching.\n- **Complete Product Data Preservation**: Cloned orders include 14 product fields for rich metadata including images, stock status, and pricing variants.\n- **Dual-Format Support**: Seamlessly handles both legacy WooCommerce and new custom API order formats.\n- **Fixed Shipping Method Display**: Orders now display actual shipping method names (e.g., 'Free shipping', 'Express') instead of generic 'Shipping'.\n- **Bulk SMS & Status-Based Notifications**: Automate customer communication for orders, status updates, and promotions.\n- **On-Click Courier Entry**: Quickly assign courier details from the order dashboard.\n- **Voucher Printing**: Generate printable vouchers for orders.\n- **Fraud Prevention Tools**: Identify and block suspicious customers by phone or IP.\n- **OTP Validation at Checkout**: Secure transactions by verifying phone numbers.\n- **Custom Order Statuses & SMS Updates**: Define and notify customers about custom statuses.\n- **Dashboard Analytics**: View sales trends, abandoned carts, and courier balances in one place.\n- **Blacklist Management**: Block fraudulent customers from making future purchases.\n- **Advanced Order Management**: Enhanced order filtering, bulk operations, and status changes.\n- **Real-time Fraud Detection**: AI-powered customer risk analysis and delivery prediction.\n- **Multi-Courier Integration**: Seamless integration with Steadfast and other courier services.\n- **Customer Analytics**: Deep insights into customer behavior and order patterns.\n- **Abandoned Cart Recovery**: Track and recover abandoned carts with automated notifications.\n- **Custom Checkout Fields**: Automatic capture and display of custom billing/shipping fields from any checkout plugin.\n- **Flexible Field Management**: Save custom field values to courier, invoice, or customer notes with dropdown selection.\n- **Cache Prevention System**: Prevents API caching by 12+ major cache plugins including WP Rocket, LiteSpeed, Cloudflare, W3 Total Cache, FlyingPress, NitroPack, and more.\n- **CORS Support**: Full cross-origin resource sharing for seamless frontend/Vue.js integration.\n- **Organized Navigation**: Dashboard submenu structure with Dashboard, Orders, Missing Orders, and Black List sections.\n\n### **Recent Updates (v1.2.0)**\n- NEW: Order cloning feature with complete product, shipping, and payment data preservation.\n- NEW: Dual-format support for both legacy WooCommerce and new custom API order formats.\n- NEW: Smart shipping method lookup with automatic zone detection and instance ID matching.\n- NEW: Complete product data preservation with 14 fields including images and stock status.\n- NEW: Shipping zone support - properly handles shipping methods configured across multiple zones.\n- FIX: Shipping method title now displays correctly (actual method names instead of 'Shipping').\n- FIX: Backend properly resolves shipping methods across all zones using instance ID matching.",
    "changelog": "= 1.2.0 =\n* NEW: Order cloning feature with complete product, shipping, and payment data preservation.\n* NEW: Dual-format support for both legacy WooCommerce and new custom API order formats.\n* NEW: Smart shipping method lookup with automatic zone detection and instance ID matching.\n* NEW: Complete product data preservation with 14 fields (id, name, price, currency, regular_price, sale_price, sku, stock_status, stock_quantity, in_stock, type, permalink, image, from).\n* NEW: Shipping zone support - properly handles shipping methods configured across multiple zones.\n* NEW: Improved shipping method backend with instance-based lookup.\n* IMPROVED: Order creation workflow with comprehensive validation and error handling.\n* IMPROVED: Better form validation with specific error messages for missing data.\n* IMPROVED: TypeScript composables with proper type safety (ShippingMethod interface).\n* IMPROVED: Vue 3 Composition API refactoring for better code organization.\n* IMPROVED: Graceful fallbacks for missing data with appropriate defaults.\n* FIX: Shipping method title now displays actual method name (e.g., 'Free shipping') instead of generic 'Shipping'.\n* FIX: Backend now properly resolves instance-based shipping methods in specific zones.\n* FIX: Fixed dependency injection for shippingMethods and paymentMethods.\n* ENHANCEMENT: Complete documentation with SHIPPING_METHOD_BACKEND_FIX.md, SHIPPING_METHOD_COMPLETE_STRUCTURE.md, PRODUCT_DATA_STRUCTURE.md.\n* ENHANCEMENT: API response consistency with complete zone information.\n* ENHANCEMENT: Frontend-backend alignment for shipping method data structures.\n\n= 1.1.9 =\n* FIX: Fixed issue where new orders were getting refreshed when clicking on courier refresh to bulk refresh.\n\n= 1.1.8 =\n* NEW: Double-click editable consignment ID field in order delivery partner section for quick inline editing.\n* NEW: Keyboard shortcuts for consignment ID editing - Enter to save, Escape to cancel, click outside to save.\n* NEW: Visual hover effects on editable consignment ID field with subtle border and background changes.\n* IMPROVED: Enhanced UX for courier data management with instant inline updates without page refresh.\n* IMPROVED: Consignment ID field now displays 'Not set' when empty for better user clarity.\n* IMPROVED: Auto-focus on input field when entering edit mode for faster data entry.\n* ENHANCEMENT: Seamless editing experience with automatic save on blur (click outside).\n* ENHANCEMENT: Better visual indication of editable fields with cursor pointer and tooltip.\n* ENHANCEMENT: Smoother transition between view and edit modes for consignment IDs.",
    "repository": "https://github.com/your-repo/woo-easy-life",
    "support": "https://github.com/your-repo/woo-easy-life/issues"
  },
  "icons": {
    "1x": "https://wpsalehub.com/wp-content/uploads/2025/01/Health-care-logo-3.webp",
    "2x": "https://wpsalehub.com/wp-content/uploads/2025/01/Health-care-logo-3.webp",
    "svg": null
  }
}